<a href="https://colab.research.google.com/github/cswizard11/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module1-exploratory-data-analysis/LS_DS_111_Exploratory_Data_Analysis%20Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Learning Objectives

# Exploratory Data Analysis

- Objective 01 - submit assignments and save work via GitHub
- Objective 02 - load a CSV dataset from a URL using `pandas.read_csv`
- Objective 03 - load a CSV dataset from a local file using `pandas.read_csv
- Objective 04 - use basic Pandas functions for Exploratory Data Analysis-EDA
- Objective 05 - describe and discriminate between basic data types such as categorical, quantitative, continuous, discrete, ordinal, nominal and identifier

#Explore the University of California - Irvine Adult Dataset

###1) Load a dataset via its URL.

Load the Adult dataset from: 'https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data'

Specify the column headers as:'age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital-status', 'occupation', 'relationship', 'race', 'sex', 'capital-gain', 'capital-loss', 'hours-per-week','native-country', 'income']

In [21]:
#Code here
import pandas as pd
import numpy as np
headers = ['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital-status', 'occupation', 'relationship', 'race', 'sex', 'capital-gain', 'capital-loss', 'hours-per-week','native-country', 'income']
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', names=headers, skipinitialspace=True)
df = df.replace({'?': np.NaN})

In [22]:
#Code here
df.head(20)

    age         workclass  fnlwgt  ... hours-per-week  native-country income
0    39         State-gov   77516  ...             40   United-States  <=50K
1    50  Self-emp-not-inc   83311  ...             13   United-States  <=50K
2    38           Private  215646  ...             40   United-States  <=50K
3    53           Private  234721  ...             40   United-States  <=50K
4    28           Private  338409  ...             40            Cuba  <=50K
5    37           Private  284582  ...             40   United-States  <=50K
6    49           Private  160187  ...             16         Jamaica  <=50K
7    52  Self-emp-not-inc  209642  ...             45   United-States   >50K
8    31           Private   45781  ...             50   United-States   >50K
9    42           Private  159449  ...             40   United-States   >50K
10   37           Private  280464  ...             80   United-States   >50K
11   30         State-gov  141297  ...             40           India   >50K
12   23           Private  122272  ...             30   United-States  <=50K
13   32           Private  205019  ...             50   United-States  <=50K
14   40           Private  121772  ...             40             NaN   >50K
15   34           Private  245487  ...             45          Mexico  <=50K
16   25  Self-emp-not-inc  176756  ...             35   United-States  <=50K
17   32           Private  186824  ...             40   United-States  <=50K
18   38           Private   28887  ...             50   United-States  <=50K
19   43  Self-emp-not-inc  292175  ...             45   United-States   >50K

[20 rows x 15 columns]

In [23]:
#Code here
df.tail()

       age     workclass  fnlwgt  ... hours-per-week  native-country income
32556   27       Private  257302  ...             38   United-States  <=50K
32557   40       Private  154374  ...             40   United-States   >50K
32558   58       Private  151910  ...             40   United-States  <=50K
32559   22       Private  201490  ...             20   United-States  <=50K
32560   52  Self-emp-inc  287927  ...             40   United-States   >50K

[5 rows x 15 columns]

###3) Determine the data type of each varaible.

In [24]:
#Code here
df.dtypes

age                int64
workclass         object
fnlwgt             int64
education         object
education-num      int64
marital-status    object
occupation        object
relationship      object
race              object
sex               object
capital-gain       int64
capital-loss       int64
hours-per-week     int64
native-country    object
income            object
dtype: object

###4) Determine the dimensions of the dataset.

In [25]:
#Code here
df.shape

(32561, 15)

###5) Are there any missing values in the dataset?
Check for missing values using .isnull().sum().

In [26]:
#Code here
df.isnull().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education-num        0
marital-status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital-gain         0
capital-loss         0
hours-per-week       0
native-country     583
income               0
dtype: int64

###6) Use the .describe() function in order to see the summary statistics of the numeric columns.

Are there any values shown that might be a code for missing data?  We'll learn how to change the values in a DataFrame tomorrow.

In [27]:
#Code here
df.describe()

                age        fnlwgt  ...  capital-loss  hours-per-week
count  32561.000000  3.256100e+04  ...  32561.000000    32561.000000
mean      38.581647  1.897784e+05  ...     87.303830       40.437456
std       13.640433  1.055500e+05  ...    402.960219       12.347429
min       17.000000  1.228500e+04  ...      0.000000        1.000000
25%       28.000000  1.178270e+05  ...      0.000000       40.000000
50%       37.000000  1.783560e+05  ...      0.000000       40.000000
75%       48.000000  2.370510e+05  ...      0.000000       45.000000
max       90.000000  1.484705e+06  ...   4356.000000       99.000000

[8 rows x 6 columns]

Answer question here.

###7) Use the .describe(exclude='number') function to calculate summary statistics for the non-numeric columns

In [28]:
#Code here
df.describe(exclude="number")

       workclass education      marital-status  ...    sex native-country income
count      30725     32561               32561  ...  32561          31978  32561
unique         8        16                   7  ...      2             41      2
top      Private   HS-grad  Married-civ-spouse  ...   Male  United-States  <=50K
freq       22696     10501               14976  ...  21790          29170  24720

[4 rows x 9 columns]

###8) Calculate the number of observations in each category of the relationship variable.

In [31]:
#Code here
df["relationship"].size

32561

###9) Select and print the occupation category.

In [32]:
#Code here
print(df["occupation"])

0             Adm-clerical
1          Exec-managerial
2        Handlers-cleaners
3        Handlers-cleaners
4           Prof-specialty
               ...
32556         Tech-support
32557    Machine-op-inspct
32558         Adm-clerical
32559         Adm-clerical
32560      Exec-managerial
Name: occupation, Length: 32561, dtype: object

#Load a dataset saved on your personal computer

Go to the website http://users.stat.ufl.edu/~winner/datasets.html and scroll down to **NASCAR Race Results by Driver 1975-2003**

Download and save the .csv file to your personal computer.

###10) Upload the dataset using the following commands.

In [ ]:
from google.colab import files
uploaded = files.upload()

In [ ]:
#Code here

###11) Print the first 10 rows of the dataset

In [ ]:
#Code here

###12) Answer the following questions for the variables prize, carMake and driver:


*   Is the variable categorical or quantitative?
*   If the variable is categorical, determine if it is ordinal, nominal or an identifier variable.
*   If the vriable is quantitative, determine if it is continuous or discrite.

#Answer here.

#Data Storytelling Project Milestone

Begin looking at Data Storytelling (previously called Build Week) [project info](https://github.com/LambdaSchool/DS-Unit-1-Build) and at projects created by previous Lambda students.

[Projects — Lambda DS1!](https://drive.google.com/file/d/1RJoAqDgawzSHOJPlDQRRlfz-EnIsskpL/view)